MrBlinky/Arduboy-homemade-package/board-package-source/boards.txt
arduboy-homemade.menu.display.128x128=SSD1327/29 (128x128)
arduboy-homemade.menu.display.128x128.build.display=-128x128
arduboy-homemade.menu.display.128x128.usb_product_postfix=128128
arduboy-homemade.menu.display.128x128.bootloader_display=-ssd132x-128x128
arduboy-homemade.menu.display.128x128.build.extra_flags=-DARDUBOY_10 -DOLED_128X128 {build.flash_cs} {build.contrast} {build.usb_flags}

arduboy-homemade.menu.display.st7565=LCD ST7565 (backlit)
arduboy-homemade.menu.display.st7565.build.display=-st7565
arduboy-homemade.menu.display.st7565.usb_product_postfix=lcd
arduboy-homemade.menu.display.st7565.bootloader_display=-st7565
arduboy-homemade.menu.display.st7565.build.extra_flags=-DARDUBOY_10 -DLCD_ST7565 {build.flash_cs} {build.contrast} {build.usb_flags}

arduboy-homemade.menu.display.gu12864_800b=GU12864-800B
arduboy-homemade.menu.display.gu12864_800b.build.display=-gu12864
arduboy-homemade.menu.display.gu12864_800b.usb_product_postfix=vfd
arduboy-homemade.menu.display.gu12864_800b.bootloader_display=-gu12864
arduboy-homemade.menu.display.gu12864_800b.build.extra_flags=-DARDUBOY_10 -DGU12864_800B {build.flash_cs} {build.contrast} {build.usb_flags}

# External flash chip select pin #

arduboy-homemade.menu.flashselect.sda=Pin2/D1/SDA (official)
arduboy-homemade.menu.flashselect.sda.build.flash_cs=-DCART_CS_SDA
arduboy-homemade.menu.flashselect.sda.build.flashselect=-sda
arduboy-homemade.menu.flashselect.sda.bootloader_flashselect=-sda

arduboy-homemade.menu.flashselect.rx=Pin0/D2/Rx (original)
arduboy-homemade.menu.flashselect.rx.build.flash_cs=-DCART_CS_RX
arduboy-homemade.menu.flashselect.rx.build.flashselect=
arduboy-homemade.menu.flashselect.rx.bootloader_flashselect=

# Display contrast adjustment #

arduboy-homemade.menu.contrast.normal=Normal
arduboy-homemade.menu.contrast.normal.build.contrast=

arduboy-homemade.menu.contrast.dimmed=Dimmed
arduboy-homemade.menu.contrast.dimmed.build.contrast=-DOLED_CONTRAST=0x7F

arduboy-homemade.menu.contrast.low=Low
arduboy-homemade.menu.contrast.low.build.contrast=-DOLED_CONTRAST=0x2F

arduboy-homemade.menu.contrast.lowest=Lowest
arduboy-homemade.menu.contrast.lowest.build.contrast=-DOLED_CONTRAST=0x00

arduboy-homemade.menu.contrast.highest=Highest
arduboy-homemade.menu.contrast.highest.build.contrast=-DOLED_CONTRAST=0xFF

################################################################################
# Arduboy FX board
################################################################################

arduboy-fx.name=Arduboy FX

#Arduino Leonardo
arduboy-fx.vid.0=0x2341
arduboy-fx.pid.0=0x0036
arduboy-fx.vid.1=0x2341
arduboy-fx.pid.1=0x8036
arduboy-fx.vid.2=0x2A03
arduboy-fx.pid.2=0x0036
arduboy-fx.vid.3=0x2A03
arduboy-fx.pid.3=0x8036
#Arduino Micro
arduboy-fx.vid.4=0x2341
arduboy-fx.pid.4=0x0037
arduboy-fx.vid.5=0x2341
arduboy-fx.pid.5=0x8037
arduboy-fx.vid.6=0x2A03
arduboy-fx.pid.6=0x0037
arduboy-fx.vid.7=0x2A03
arduboy-fx.pid.7=0x8037
#Genuino Micro
arduboy-fx.vid.8=0x2341
arduboy-fx.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-fx.vid.8=0x1b4f
arduboy-fx.pid.8=0x9205
arduboy-fx.vid.9=0x1b4f
arduboy-fx.pid.9=0x9206

arduboy-fx.upload.tool=arduino:avrdude
arduboy-fx.upload.protocol=avr109
arduboy-fx.upload.maximum_size=28672
arduboy-fx.upload.maximum_data_size=2560
arduboy-fx.upload.speed=57600
arduboy-fx.upload.disable_flushing=true
arduboy-fx.upload.use_1200bps_touch=true
arduboy-fx.upload.wait_for_upload_port=true

arduboy-fx.bootloader.tool=arduino:avrdude
arduboy-fx.bootloader.low_fuses=0xff
arduboy-fx.bootloader.high_fuses=0xd2
arduboy-fx.bootloader.extended_fuses=0xcb
arduboy-fx.bootloader.file=cathy3k/arduboy3k-bootloader-menu-sda.hex
arduboy-fx.bootloader.unlock_bits=0x3F
arduboy-fx.bootloader.lock_bits=0x2F

arduboy-fx.build.mcu=atmega32u4
arduboy-fx.build.f_cpu=16000000L
arduboy-fx.build.variant=arduboy
arduboy-fx.build.board=AVR_ARDUBOY
arduboy-fx.build.vid=0x2341
arduboy-fx.build.pid=0x8036
arduboy-fx.build.variant=arduboy
arduboy-fx.build.usb_product="Arduboy"
arduboy-fx.build.board=AVR_ARDUBOY
arduboy-fx.build.core=arduino:arduino
arduboy-fx.build.flash_cs=-DCART_CS_SDA
arduboy-fx.build.extra_flags=-DARDUBOY_10 {build.flash_cs} {build.usb_flags}

# Arduboy FX menu options ######################################################

arduboy-fx.menu.core.arduboy-core=Arduboy optimized core
arduboy-fx.menu.core.arduboy-core.build.core=arduboy

arduboy-fx.menu.core.arduino-core=Standard Arduino core
arduboy-fx.menu.core.arduino-core.build.core=arduino:arduino

arduboy-fx.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy-fx.menu.boot.cathy3k.upload.maximum_size=29696
arduboy-fx.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy-fx.menu.boot.cathy3k.bootloader.file=cathy3k/arduboy3k-bootloader-menu-sda.hex

arduboy-fx.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy-fx.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy-fx.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy-fx.menu.boot.cathy3kg.bootloader.file=cathy3k/arduboy3k-bootloader-game-sda.hex

################################################################################
# Arduboy FX DevKit board
################################################################################

arduboy-fx-devkit.name=Arduboy FX DevKit

#Arduino Leonardo
arduboy-fx-devkit.vid.0=0x2341
arduboy-fx-devkit.pid.0=0x0036
arduboy-fx-devkit.vid.1=0x2341
arduboy-fx-devkit.pid.1=0x8036
arduboy-fx-devkit.vid.2=0x2A03
arduboy-fx-devkit.pid.2=0x0036
arduboy-fx-devkit.vid.3=0x2A03
arduboy-fx-devkit.pid.3=0x8036
#Arduino Micro
arduboy-fx-devkit.vid.4=0x2341
arduboy-fx-devkit.pid.4=0x0037
arduboy-fx-devkit.vid.5=0x2341
arduboy-fx-devkit.pid.5=0x8037
arduboy-fx-devkit.vid.6=0x2A03
arduboy-fx-devkit.pid.6=0x0037
arduboy-fx-devkit.vid.7=0x2A03
arduboy-fx-devkit.pid.7=0x8037
#Genuino Micro
arduboy-fx-devkit.vid.8=0x2341
arduboy-fx-devkit.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-fx-devkit.vid.8=0x1b4f
arduboy-fx-devkit.pid.8=0x9205
arduboy-fx-devkit.vid.9=0x1b4f
arduboy-fx-devkit.pid.9=0x9206

arduboy-fx-devkit.upload.tool=arduino:avrdude
arduboy-fx-devkit.upload.protocol=avr109
arduboy-fx-devkit.upload.maximum_size=28672
arduboy-fx-devkit.upload.maximum_data_size=2560
arduboy-fx-devkit.upload.speed=57600
arduboy-fx-devkit.upload.disable_flushing=true
arduboy-fx-devkit.upload.use_1200bps_touch=true
arduboy-fx-devkit.upload.wait_for_upload_port=true

arduboy-fx-devkit.bootloader.tool=arduino:avrdude
arduboy-fx-devkit.bootloader.low_fuses=0xff
arduboy-fx-devkit.bootloader.high_fuses=0xd2
arduboy-fx-devkit.bootloader.extended_fuses=0xcb
arduboy-fx-devkit.bootloader.file=cathy3k/arduboy3k-bootloader-menu-sda.hex
arduboy-fx-devkit.bootloader.unlock_bits=0x3F
arduboy-fx-devkit.bootloader.lock_bits=0x2F

arduboy-fx-devkit.build.mcu=atmega32u4
arduboy-fx-devkit.build.f_cpu=16000000L
arduboy-fx-devkit.build.variant=arduboy
arduboy-fx-devkit.build.board=AVR_ARDUBOY
arduboy-fx-devkit.build.vid=0x2341
arduboy-fx-devkit.build.pid=0x8036
arduboy-fx-devkit.build.variant=arduboy
arduboy-fx-devkit.build.usb_product="Arduboy"
arduboy-fx-devkit.build.board=AVR_ARDUBOY
arduboy-fx-devkit.build.core=arduino:arduino
arduboy-fx-devkit.build.flash_cs=-DCART_CS_RX
arduboy-fx-devkit.build.extra_flags=-DARDUBOY_10 {build.flash_cs} {build.usb_flags}

# Arduboy FX DevKit menu options ###############################################

